Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: The finalize method itself will never be invoked more than once for a given object.
ja: finalizeメソッドそれ自身は、指定されたオブジェクトに対して一回以上発動されることは決してありません。

source: The properties are derived from the with properties parameter of the duplicate command.
ja: propertiesは、duplicateコマンドのwith propertiesパラメータから引き出されます。

source: The a String argument should be formatted like the output of NSString From Size(_:), for example, @"{10,20}".
ja: a String引数は、NSString From Size(_:)の出力のように体裁を整えられるべきです、例えば、@"{10,20}"。

source: The NSArray class adopts the NSCopying, NSMutable Copying, and NSCoding protocols; custom subclasses of NSArray should override the methods in these protocols as necessary.
ja: NSArrayクラスは、NSCopying、NSMutable Copying、そしてNSCodingプロトコルを採用します；NSArrayのカスタムサブクラスは、必要に応じてこれらのプロトコルにおいてメソッドをオーバーライドすべきです。

source: The AM symbol for the receiver.
ja: シレーバに対するAMシンボル。

source: The Apple event to execute.
ja: 実行するアップルイベント。

source: The Base-64 encoded data.
ja: Base-64エンコードされたデータ。

source: The Base-64 encoded string.
ja: Base-64エンコードされた文字列。

source: The Basic Multilingual Plane (BMP) is plane 0.
ja: 基本多言語面 (BMP) は、０面です。

source: The Block can set the value to true to stop further processing of the array.
ja: ブロックはtrueに設定されることで、それ以上の配列の処理を止めることができます。

source: The Block enumerates the matches of the regular expression in the string.
ja: 文字列中のその正規表現の全てのマッチを列挙する「ブロック」。

source: The Block enumeration method enumerate Matches(in: options: range: using:) is the most general and flexible of the matching methods of NSRegular Expression.
ja: 「ブロック」列挙メソッドenumerate Matches(in: options: range: using:)は、NSRegular Expressionのマッチング・メソッドの最も一般的で柔軟性に富むものです。

source: The Block returns a Boolean value that indicates whether obj passed the test.
ja: この「ブロック」はobjがテストを合格したかどうかを示すブール値を返します。

source: The Block returns void.
ja: 「ブロック」は、voidを返します。

source: The Boolean value to be set in the returned descriptor.
ja: 返される記述子の中に設定されるブール値。

source: The Foundation framework provides a base layer of functionality for apps and frameworks, including data storage and persistence, text processing, date and time calculations, sorting and filtering, and networking.
ja: Foundationフレームワークは、さまざまなアプリやフレームワークに対して機能性の基盤層を提供し、データのストレージと永続、テキスト処理、日付と時刻計算、ソートとフィルタ、およびネットワークを含んでいます。

source: The Foundation framework provides concrete subclasses for many of the most common types of physical units.
ja: Foundationフレームワークは、最も一般的な種類の物理的な単位の多くに対して具体的なサブクラスを提供します。

source: The Foundation framework provides several concrete subclasses of Formatter, including Byte Count Formatter, Date Formatter, Date Components Formatter, Date Interval Formatter, Energy Formatter, Length Formatter, Mass Formatter, Number Formatter, and Person Name Components Formatter.
ja: Foundationフレームワークはいくつかの具体的なサブクラスをFormatterに提供し、それは次を含みます、Byte Count Formatter, Date Formatter, Date Components Formatter, Date Interval Formatter, Energy Formatter, Length Formatter, Mass Formatter, Number Formatter, そして Person Name Components Formatter。

source: The Gregorian calendar defines a week to have 7 days, and a year to have 356 days, or 366 in a leap year.
ja: グレゴリオ暦は、週に７日を持つ、そして年に356、または閏年で366日を持つと定義します。

source: The HFS file type code corresponding to file Type String, or 0 if it cannot be found.
ja: file Type Stringに対応しているHFSファイルタイプコード、またはそれが見つけられないならば0。

source: The HTTP status code to return (404, for example).
ja: 返すことになるHTTP状態コード（例えば、404）。

source: The HTTP status code.
ja: HTTP状態コード。

source: The ICU regular expressions supported by NSRegular Expression are described at http://userguide.icu-project.org/strings/regexp.
ja: NSRegular ExpressionでサポートされるICU正規表現はhttp://userguide.icu-project.org/strings/regexpで記述されます。

source: The IEEE 754 class of this type.
ja: この型の属するIEEE 754クラス。

source: The ISO 8601 specification allows for dates to be expressed in a variety of ways.
ja: ISO 8601仕様は、日付が多様なやり方で表されることを想定しています。

source: The ISO 8601 week-numbering year of the receiver.
ja: レシーバのISO 8601週番号年。

source: The Islamic Umm al-Qura calendar used in Saudi Arabia.
ja: イスラムのウンム・アル＝クラーカレンダー、サウジアラビアで使われます。

source: The JSON object to decode.
ja: デコードするJSONオブジェクト。

source: The PM symbol for the receiver.
ja: シレーバに対するPMシンボル。

source: The POSIX file descriptor associated with the receiver.
ja: レシーバと結び付けられたPOSIXファイル記述子。

source: The POSIX file descriptor with which to initialize the file handle.
ja: それでファイルハンドルを初期化するPOSIXファイル記述子。

source: The SI unit of measure for radioactivity is the becquerel (Bq), which is defined as the quantity of radioactive material in which one nucleus decays per second (1 Bq = 1 s-1).
ja: 放射能の計測のSI単位はベクレル（Bq）です、それは秒あたり１つの原子核が崩壊する放射性物質の量として定義されます（1 Bq = 1 s-1）。

source: The Swift API Design Guidelines recommend using camel-case names.
ja: Swift API Design Guidelinesは、キャメルケース名を使うことを推奨します。

source: The Swift standard library defines a standardized approach to data encoding and decoding.
ja: Swift標準ライブラリは、標準化された取り組みをデータのエンコードとデコードに対して定義します。

source: The URL associated with the added cookies.
ja: 加えられるクッキーと結び付けられているURL。

source: The URL associated with the created cookies.
ja: 作成されたクッキーと結び付けられるURL。

source: The URL associated with this error, if any.
ja: このエラーと関連するURL、もしあれば。

source: The URL at which to place the copy of src URL.
ja: そこにsrc URLのコピーを置くことになるURL。

source: The URL for the directory whose contents you want to enumerate.
ja: それの内容をあなたが列挙するのを望むディレクトリに対するURL。

source: The URL for the file or directory that the file manager tried to delete.
ja: ファイルマネージャが削除を試みたファイルまたはディレクトリへのURL。

source: The URL from which the response was generated.
ja: それから応答が生成されたURL。

source: The URL identifying the destination of the link.
ja: リンクの行き先を識別するURL。

source: The URL identifying the new hard link to be created.
ja: 作成される新しいハードリンクを識別するURL。

source: The URL in this parameter must not be a file reference URL and must include the name of the file in its new location.
ja: このパラメータの中のURLは、ファイル参照URLであってはいけません、そしてそのファイルのそれの新しい場所での名前を含まなければなりません。

source: The URL in this parameter must not be a file reference URL and must include the name of the file or directory in its new location.
ja: このパラメータの中のURLは、ファイル参照URLであってはいけません、そしてそのファイルまたはディレクトリのそれの新しい場所での名前を含まなければなりません。

source: The URL in this parameter must not be a file reference URL.
ja: このパラメータの中のURLは、ファイル参照URLであってはいけません。

source: The URL in this parameter must not be a file reference URL; it must specify the actual path to the item.
ja: このパラメータの中のURLは、ファイル参照URLであってはいけません；それは項目への実際のパスを指定しなければなりません。

source: The URL in this parameter must specify a directory.
ja: このパラメータの中のURLは、ディレクトリを指定しなければなりません。

source: The URL indicating the file or directory that the file manager is attempting to delete.
ja: ファイルマネージャが削除を試みているファイルまたはディレクトリを指し示すURL。

source: The URL must be prefixed with the base URL returned from the url(for Ubiquity Container Identifier:) method that corresponds to the item’s location.
ja: URLは、項目の場所に相当する、url(for Ubiquity Container Identifier:)メソッドから返される基底URLで接頭辞を付けられなければなりません。

source: The URL of a type checking result.
ja: ある型チェックの結果のURL。

source: The URL of the attempted link location.
ja: 試みられたリンク位置のURL。

source: The URL of the directory that potentially contains the item in other URL.
ja: 潜在的にother URLの中の項目を含むディレクトリのURL。

source: The URL of the file or directory that the file manager tried to move.
ja: ファイルマネージャが移動しようとしたファイルまたはディレクトリのURL。

source: The URL of the file or directory that the file manager wants to copy.
ja: ファイルマネージャがコピーを望むファイルまたはディレクトリのURL。

source: The URL of the file or directory that the file manager wants to move.
ja: ファイルマネージャが移動を望むファイルまたはディレクトリのURL。

source: The URL of the file or directory that was the destination of the hard link.
ja: ハードリンクの行き先だったファイルまたはディレクトリのURL。

source: The URL of the file or directory whose relationship to directory URL is being tested.
ja: ファイルまたはディレクトリのURL、それのdirectory URLへの関係がテストされています。

source: The URL of the file, device, or named socket to access.
ja: アクセスするファイル、デバイス、または名前付きソケットのURL。

source: The URL of the intended destination for the item in src URL.
ja: src URLの中の項目に対する意図される行き先のURL。

source: The URL of the main HTML document for the top-level frame, if known.
ja: トップレベルフレームに対するメインHTMLドキュメントのURL、もし知られるならば。

source: The URL of the script file.
ja: スクリプトファイルのURL。

source: The URL or a file or directory that file Manager is attempting to copy.
ja: file Managerがコピーを試みたファイルまたはディレクトリへのURL。

source: The URL or a file or directory to which file Manager is attempting to copy.
ja: それに向けてfile Managerがコピーを試みたファイルまたはディレクトリへのURL。

source: The URL referenced by the file wrapper object, which must be a symbolic-link file wrapper.
ja: ファイルラッパーオブジェクトによって参照されるURL、それはシンボリックリンクファイルラッパーでなければなりません。

source: The URL response object associated with the receiver.
ja: レシーバと関連付けられたURL応答オブジェクト。

source: The URL specifying the location for the copied file or directory.
ja: コピーされたファイルまたはディレクトリに対する場所を識別するURL。

source: The URL specifying the new location for the file or directory.
ja: ファイルまたはディレクトリに対する新しい場所を指定するURL。

source: The URL to filter on.
ja: このURLでフィルタすることになります。

source: The URL to the file.
ja: ファイルに対するURL。

source: The URL you specify may contain additional subdirectories so that you can organize your files hierarchically in iCloud.
ja: あなたが指定するURLは追加の下位ディレクトリを含むかもしれません、それであなたがiCloudにおいて階層的にあなたのファイルを組織化できるように。

source: The absolute pathname of the resource file or nil if the file is not found.
ja: リソースファイルの絶対パス名、またはファイルが見つけられないならばnil。

source: The absolute pathname of the resource file or nil if the file was not found.
ja: リソースファイルの絶対パス名、またはファイルが見つけられなかったならばnil。

source: The absolute time for which the calculation is performed.
ja: それに対して計算が実行されるところの絶対時間。

source: The accessed slice uses the same indices for the same elements as the original collection uses.
ja: アクセスされるスライス（切片）は、同じ要素に対して元のコレクションが使うのと同じインデックスを使います。

source: The accessed slice uses the same indices for the same elements as the original collection.
ja: アクセスされるスライス（切片）は、同じ要素に対して元のコレクションと同じインデックスを使います。

source: The activation point for the accessibility element, in screen coordinates.
ja: アクセシビリティ要素のアクティベーションポイント、画面座標で。

source: The actual behavior for this is platform-specific; in OS X 10.8, this uses the binary style, but that may change over time.
ja: これの実際の挙動は、プラットホーム固有です；OS X 10.8では、これは２進法形式を使います、しかしそれは時を経て変わるかもしれません。

source: The actual behavior for this is platform-specific; in OS X 10.8, this uses the decimal style, but that may change over time.
ja: これの実際の挙動は、プラットホーム固有です；OS X 10.8では、これは10進法形式を使います、しかしそれは時を経て変わるかもしれません。

source: The actual name of the item may be changed when moving it to the trash, so use this URL to access it.
ja: 項目の実際の名前は、それをゴミ箱へ移動する時に変更されるかもしれません、なのでこのURLをそれにアクセスするのに使ってください。

source: The add padding zeroes behavior.
ja: ゼロ詰めを加える挙動。

source: The address of the implementation of the a Selector instance method.
ja: a Selectorインスタンスメソッドの実装のアドレス。

source: The address of the receiver’s implementation of the a Selector.
ja: このレシーバでのa Selectorの実装のアドレス。

source: The algorithm will try to produce a result which is in the next-larger component to the one given (there’s a table of this mapping at the top of this document).
ja: アルゴリズムは、与えられたものの次に大きな構成要素の中にある結果を生み出そうと試みます（このマッピングの表がこの文書の上部にあります）。

source: The allocated pages are guaranteed to be filled with zeros.
ja: アロケートされたページは、ゼロで満たされることを保証されます。

source: The allowed calendar units are:
ja: 許可されるカレンダー単位は：

source: The archiver creating an archive.
ja: アーカイブを作成するアーカイバ。

source: The argument subpath specifies the name of a specific subdirectory to search within the current bundle’s resource directory hierarchy.
ja: 引数subpathは、現在のバンドルの持つリソースディレクトリ階層の内部を検索するために、ある特定の下位ディレクトリの名前を指定します。

source: The argument to pass to the method when it is invoked.
ja: メソッドに、それが発動されるときに渡される引数。

source: The arguments to the Block object are two objects to compare.
ja: Block objectへの引数は、比較される２つのオブジェクトです。

source: The array does not contain references to the File’s Owner or any proxy objects; it contains only those objects that were instantiated when the nib file was unarchived.
ja: 配列は、File’s Ownerまたは何らかのプロキシオブジェクトへの参照を含みません；それは、nibファイルがアンアーカイブされた時にインスタンス化されたオブジェクトそれらのみを含みます。

source: The array of created cookies.
ja: 作成されたクッキーからなる配列。

source: The array of short month symbols for the receiver.
ja: レシーバに対する短い月シンボルからなる配列。

source: The array of short standalone weekday symbols for the receiver.
ja: レシーバに対する短い単独動作型の曜日シンボルからなる配列。

source: The array of short weekday symbols for the receiver.
ja: レシーバに対する短い曜日シンボルからなる配列。

source: The array of standalone weekday symbols for the receiver.
ja: レシーバに対する単独動作型の曜日シンボルからなる配列。

source: The array of very short standalone weekday symbols for the receiver.
ja: レシーバに対する非常に短い単独動作型の曜日シンボルからなる配列。

source: The array of very short weekday symbols for the receiver.
ja: レシーバに対する非常に短い曜日シンボルからなる配列。

source: The array of weekday symbols for the receiver.
ja: レシーバに対する曜日シンボルからなる配列。

source: The array representation at the location identified by a URL must contain only property list objects (NSString, NSData, NSArray, or NSDictionary objects).
ja: a URLによって識別される場所での配列表現は、ただプロパティリストオブジェクト（NSString、NSData、NSArray、またはNSDictionaryオブジェクト）だけを含んでいなければなりません。

source: The array representation in the file identified by a Path must contain only property list objects (NSString, NSData, NSArray, or NSDictionary objects).
ja: a Pathによって指定されるファイルの中の配列表現は、ただプロパティリストオブジェクト（NSString、NSData、NSArray、またはNSDictionaryオブジェクト）だけを含んでいなければなりません。

source: The array representation in the file identified by a Path must contain only property list objects (NSString, NSData, NSDate, NSNumber, NSArray, or NSDictionary objects).
ja: a Pathによって識別されるファイルの中の配列表現は、ただプロパティリストオブジェクト（NSString、NSData、NSDate、NSNumber、NSArray、またはNSDictionaryオブジェクト）だけを含んでいなければなりません。

source: The association between the case name and its raw value lets you name your data structures according to the Swift API Design Guidelines rather than having to match the names, punctuation, and capitalization of the serialization format you're modeling.
ja: ケース節名とそれの生の値の間の関連性は、あなたにSwift API Design Guidelinesに従ってあなたのデータ構造体に名前を付けさせます、あなたがモデリングしているシリアライズ形式での名前、句読点、そして大文字の使い方に合わせるのではなく。

source: The attribute descriptor for the specified keyword, or nil if an error occurs.
ja: 指定されたキーワードに対する属性記述子、またはエラーが起こるならばnil。

source: The attribute descriptor to add to the receiver.
ja: レシーバに加えられることになる属性記述子。

source: The attributes you can set are owner and group numbers, file permissions, and modification date.
ja: あなたが設定できる属性は、所有者とグループ番号、ファイル権限、そして修正日です。

source: The autoupdating Calendar will only compare equal to another autoupdating Calendar.
ja: 自動更新Calendarは、別の自動更新Calendarと等しいことを比較されるだけです。

source: The available phrases depend on the locale for the date formatter; whereas, for dates in the future, English may only allow “tomorrow,” French may allow “the day after the day after tomorrow,” as illustrated in the following example.
ja: 利用可能な語句は、日付フォーマッタに対するロケールに依存します；という次第で、未来の日付に対して、English は “tomorrow” だけが可能でしょう、French は “the day after the day after tomorrow” を可能とするでしょう、以下の例において例示されるように。

source: The backup is placed in the same directory as the original item.
ja: バックアップは、元の項目と同じディレクトリの中に位置します。

source: The backup item will be removed in the event of success unless the without Deleting Backup Item option is provided in options.
ja: バックアップ項目は、イベントの成功において取り除かれます、without Deleting Backup Itemオプションがoptionsにおいて提供される場合を除いて。

source: The basic type for floating-point scalar values in Core Graphics and related frameworks.
ja: Core Graphicsと関連フレームワークにおける浮動小数点スカラー値のための基本の型。

source: The beginning index in the range.
ja: 範囲の中の開始インデックス。

source: The beginning index in the set.
ja: 集合の中の開始インデックス。

source: The beginning index into the data.
ja: データへの冒頭インデックス。

source: The behavior of application groups differs between macOS and iOS.
ja: アプリケーショングループの挙動は、macOSとiOSで異なります。

source: The binary log of the page size.
ja: ページサイズのバイナリログ。

source: The bitmap representation.
ja: ビットマップ表現。

source: The bitmask of calendrical units such as day and month to include in the output string.
ja: 出力文字列に含まれる日にちと月のような、様々なカレンダー単位のビットマスク。

source: The block returns a Boolean value that indicates whether obj passed the test.
ja: この「ブロック」はobjがテストを合格したかどうかを示すブール値を返します。

source: The block returns an Comparison Result value to denote the ordering of the two objects.
ja: ブロックは、Comparison Result値を返して、２つのオブジェクトの順番を示します。

source: The block should take no parameters and have no return value.
ja: ブロックは、パラメータを取らずそして戻り値が無いようにしてください。

source: The block takes three arguments:
ja: ブロックは、次の3つの引数をとります：

source: The block to add to the new block operation object’s list.
ja: 新しいブロック演算オブジェクトの持つリストに加えるブロック。

source: The block to add to the receiver’s list.
ja: レシーバの持つリストに加えるブロック。

source: The block to apply to elements in the array.
ja: 配列の中の要素に適用されることになるブロック。

source: The block to use for reading the contents of the file handle asynchronously.
ja: 非同期にファイルハンドルの内容を読み込むために使うブロック。

source: The block to use for writing the contents of the file handle asynchronously.
ja: 非同期にファイルハンドルの内容を書き込むために使うブロック。

source: The block you provide must accept a single parameter that is the current file handle.
ja: あなたが提供するブロックは、現在のファイルハンドルであるただ１つのパラメータだけを受け取らなければなりません。

source: The blocks associated with the receiver.
ja: レシーバと関連付けられたブロック。

source: The blocks in this array are copies of those originally added using the add Execution Block(_:) method.
ja: この配列の中のブロックは、元々はadd Execution Block(_:)メソッドを使って加えられるもののコピーです。

source: The blocks themselves should not make any assumptions about the configuration of their execution environment.
ja: ブロックそれら自体は、それらの実行環境の構成設定について何らかの仮定をすべきではありません。

source: The bounds of the range must be valid indices of the collection.
ja: この範囲の境界は、コレクションの有効なインデックスでなければなりません。

source: The buffer is only valid until the next stream operation is performed.
ja: バッファは、ただ次のストリーム操作が実行されるまで有効なだけです。

source: The buffer must be large enough to contain the number of bytes specified by len.
ja: バッファは、lenによって指定されたバイト数を含むのに十分に大きくなければなりません。

source: The buffer must be of the size specified by the second parameter.
ja: バッファは、２番目のパラメータによって指定されるサイズのものでなければなりません。

source: The buffer of bytes to append.
ja: 加えられるバイトのバッファ。

source: The buffer’s contents are valid only until the next stream operation.
ja: バッファの内容は、ただ次のストリーム操作まで有効なだけです。

source: The bundle determines its principal class in one of two ways:
ja: バンドルは、それのプリンシパルクラスを以下の２つの方法のうち１つで決定します：

source: The bundle object provides a single interface for locating items, taking into account the bundle structure, user preferences, available localizations, and other relevant factors.
ja: バンドルオブジェクトは、単一のインターフェイスをさまざまな項目の所在を突き止めるのに提供していて、それはバンドル構造、ユーザ環境設定、利用可能な現地化、そして他の関連因子を考慮します。

source: The bundle object selects the file that is most appropriate for the underlying device.
ja: バンドルオブジェクトは、根底にあるデバイスに最も適切なファイルを選択します。

source: The bundle obtains the name of the code file to load from the dictionary returned from info Dictionary, using “NSExecutable” as the key.
ja: バンドルは、そのコードファイルの名前を獲得して、info Dictionaryから、“NSExecutable” をキーとして使って返される辞書からロードを行います。

source: The bundle obtains the principal class from the dictionary using the key NSPrincipal Class.
ja: バンドルは、キーNSPrincipal Classを使って辞書からプリンシパルクラスを獲得します。

source: The bundle’s principal class.
ja: バンドルの持つプリンシパル（主役）クラス。

source: The byte count.
ja: バイト計数。

source: The byte pointer argument should not be stored and used outside of the lifetime of the call to the closure.
ja: バイトポインタ引数は、クロージャの呼び出しのライフタイムの外側で格納および使用されるべきではありません。

source: The cache storage policy is set to the default, NSURLCache Storage Allowed, and the user info dictionary is set to nil.
ja: キャッシュストレージ方針は、省略時の状態、NSURLCache Storage Allowedに設定され、そしてユーザ情報辞書はnilに設定されます。

source: The calendar and timeZone and isLeapMonth properties cannot be set by this method.
ja: カレンダーとタイムゾーンとisLeapMonthプロパティは、このメソッドによって設定できません。

source: The calendar and timeZone and isLeapMonth property values cannot be retrieved by this method.
ja: カレンダーとタイムゾーンとisLeapMonthプロパティは、このメソッドによって取得できません。

source: The calendar for the receiver.
ja: レシーバに対するカレンダー。

source: The calendar property must be set, or the result is always false.
ja: カレンダープロパティは設定されなければなりません、また結果は常にfalseです。

source: The calendar to use for date values.
ja: 日付値に対して使うためのカレンダー。

source: The calendar used to interpret the other values in this structure.
ja: それの構造体の中の他の値を解釈するために使われるカレンダー。

source: The calorie unit.
ja: カロリー単位。

source: The canonical Unicode encoding for string objects.
ja: 文字列オブジェクトに対する正準ユニコード符号化。

source: The capitalization context if a date or date symbol is to be formatted with capitalization appropriate for a list or menu item.
ja: 日付または日付符号を大文字使用で書式設定する場合の大文字使用の文脈は、リストまたはメニュー項目に適しています。

source: The capitalization context if a date or date symbol is to be formatted with capitalization appropriate for stand-alone usage such as an isolated name on a calendar page.
ja: 日付または日付符号を大文字使用で書式設定する場合の大文字使用の文脈は、孤立した語法に適しています、例えばカレンダーページ上の分離される名前など。

source: The capitalization context if a date or date symbol is to be formatted with capitalization appropriate for the beginning of a sentence.
ja: 日付または日付符号を大文字使用で書式設定する場合の大文字使用の文脈は、ある文の始まりに適しています。

source: The capitalization context if a date or date symbol is to be formatted with capitalization appropriate for the middle of a sentence.
ja: 日付または日付符号を大文字使用で書式設定する場合の大文字使用の文脈は、ある文の真ん中に適しています。

source: The capitalization context is determined dynamically from the set {standalone, beginning Of Sentence, middle Of Sentence}.
ja: 大文字使用の文脈は、設定 {standalone, beginning Of Sentence, middle Of Sentence} から動的に決定されます。

source: The capitalization formatting context used when formatting a date.
ja: 日付を書式設定するときに使われる、頭文字大文字の書式設定文脈。

source: The case-preserving dictionary was first introduced in OS X v10.7.2 and iOS 5.
ja: 大文字指定保全の辞書は、最初にOS X 10.7.2およびiOS 5で導入されました。

source: The checkpoint behavior requires that the condition be true before the thread proceeds with its task.
ja: チェックポイント挙動は、条件が真であることをスレッドがその作業に進み出す前に要求します。

source: The child file wrapper for which you want the key.
ja: それに対してあなたがキーを望む、子ファイルラッパー。

source: The child file wrappers must return accurate values when its filename property is accessed for this to work.
ja: 子ファイルラッパーは、これが機能するために、それのfilenameプロパティがアクセスされる場合に正確な値を返さなければなりません。

source: The class does well what it is designed to do—maintain an ordered collection of objects.
ja: クラスは、それが行うように設計されたこと—オブジェクトの順番付けられたコレクションの管理—を適切に実行します。

source: The class for which instances are coerced.
ja: このクラスに対してインスタンスが強制されます。

source: The class is not intended to execute scripts built into an application; for that, use one of the Process classes.
ja: このクラスは、アプリケーションにビルドされるスクリプトを実行するよう計らいません；そのためには、Processクラスの１つを使ってください。

source: The class object for the receiver’s superclass.
ja: レシーバのスーパークラスに対するクラスオプジェクト。

source: The class object named by a Class Name, or nil if no class by that name is currently loaded.
ja: a Class Nameによって名づけられるクラスオブジェクト、またはその名前が現在ロードされるクラスがないならばnil。

source: The class of the scriptable object to be created.
ja: 作成されることになるスクリプト対応オブジェクトのクラス。

source: The class to substitute for the receiver during keyed unarchiving.
ja: キー付きアンアーカイブの間にレシーバの代理を務めるクラス。

source: The class to substitute for the receiver's own class during archiving.
ja: アーカイブしている間にレシーバ自身のクラスに対して代理を務めるクラス。

source: The class to which instances of from Class are coerced.
ja: from Classのインスタンスがそれへと強制されることになるクラス。

source: The class with which to represent value.
ja: このクラスを使ってvalueを表現することになります。

source: The classes, protocols, and data types defined by Foundation are used throughout the macOS, iOS, watchOS, and tvOS SDKs.
ja: Foundationによって定義されるクラス、プロトコル、そしてデータ型は、macOS、iOS、watchOS、およびtvOSのSDKの至る所で使用されます。

source: The client may then stop the operation by setting the contents of stop to true.
ja: クライアントは、それからstopの内容をtrueに設定することによって操作を止めることができます。
